tap "homebrew/core"
tap "manaflow-ai/cmux"
tap "schpet/tap"
brew "autoconf"
brew "automake"
brew "bash"
brew "cairo"
brew "clang-format"
brew "cloudflared"
brew "cmake"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "grpcurl"
brew "helm"
brew "htop"
brew "k9s"
brew "kubernetes-cli"
brew "lcov"
brew "libpq"
brew "libtool"
brew "llvm@18"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nvm"
brew "oh-my-posh"
brew "pango"
brew "poppler"
brew "pyenv"
brew "python@3.12"
brew "ripgrep"
brew "rtk"
brew "shellcheck"
brew "stern"
brew "swig"
brew "tailscale"
brew "temporal"
brew "texinfo"
brew "tfenv"
brew "tmux"
brew "trufflehog"
brew "typos-cli"
brew "uv"
brew "schpet/tap/linear"
cask "chatgpt"
cask "claude"
cask "cmux"
cask "codex"
cask "codex-app"
cask "discord"
cask "feishu"
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "lens"
cask "macdown"
cask "microsoft-edge"
cask "mongodb-compass"
cask "neteasemusic"
cask "raycast"
cask "surge"
cask "typeless"
cask "wechat"
cask "wpsoffice"
uv "yt-dlp"
npm "@larksuite/cli"
npm "corepack"
